{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_Conv2D1_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D1", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_MaxPooling2D1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_MaxPooling2D2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_Flatten1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_Dense1", "trainable": true, "dtype": "float32", "units": 868, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of62.bin", "group1-shard2of62.bin", "group1-shard3of62.bin", "group1-shard4of62.bin", "group1-shard5of62.bin", "group1-shard6of62.bin", "group1-shard7of62.bin", "group1-shard8of62.bin", "group1-shard9of62.bin", "group1-shard10of62.bin", "group1-shard11of62.bin", "group1-shard12of62.bin", "group1-shard13of62.bin", "group1-shard14of62.bin", "group1-shard15of62.bin", "group1-shard16of62.bin", "group1-shard17of62.bin", "group1-shard18of62.bin", "group1-shard19of62.bin", "group1-shard20of62.bin", "group1-shard21of62.bin", "group1-shard22of62.bin", "group1-shard23of62.bin", "group1-shard24of62.bin", "group1-shard25of62.bin", "group1-shard26of62.bin", "group1-shard27of62.bin", "group1-shard28of62.bin", "group1-shard29of62.bin", "group1-shard30of62.bin", "group1-shard31of62.bin", "group1-shard32of62.bin", "group1-shard33of62.bin", "group1-shard34of62.bin", "group1-shard35of62.bin", "group1-shard36of62.bin", "group1-shard37of62.bin", "group1-shard38of62.bin", "group1-shard39of62.bin", "group1-shard40of62.bin", "group1-shard41of62.bin", "group1-shard42of62.bin", "group1-shard43of62.bin", "group1-shard44of62.bin", "group1-shard45of62.bin", "group1-shard46of62.bin", "group1-shard47of62.bin", "group1-shard48of62.bin", "group1-shard49of62.bin", "group1-shard50of62.bin", "group1-shard51of62.bin", "group1-shard52of62.bin", "group1-shard53of62.bin", "group1-shard54of62.bin", "group1-shard55of62.bin", "group1-shard56of62.bin", "group1-shard57of62.bin", "group1-shard58of62.bin", "group1-shard59of62.bin", "group1-shard60of62.bin", "group1-shard61of62.bin", "group1-shard62of62.bin"], "weights": [{"name": "conv2d_Conv2D1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_Conv2D1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_Conv2D2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_Conv2D2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_Dense1/kernel", "shape": [186624, 868], "dtype": "float32"}, {"name": "dense_Dense1/bias", "shape": [868], "dtype": "float32"}]}]}